#ifndef GUARD_GUNKNOWN_203B46C_H
#define GUARD_GUNKNOWN_203B46C_H

struct UnkSaveStruct1
{
    /* 0x0 */ u8 unk0;
    /* 0x1 */ u8 unk1;
    /* 0x2 */ u8 unk2;
    /* 0x3 */ u8 unk3;
    /* 0x4 */ u8 unk4;
    /* 0x5 */ u8 unk5;
    /* 0x6 */ u8 unk6;
    /* 0x7 */ u8 unk7;
    /* 0x8 */ u8 unk8;
    /* 0x9 */ u8 unk9;
    /* 0xA */ u8 unkA;
    /* 0xB */ u8 playerGender;
    /* 0xC */ u8 unkC;
};

#endif
