struct unkTimeStruct
{
    u16 unk0;
    u8 unk2;
    u8 unk3;
    u8 unk4;
};

struct UnkStruct_203B184 {
    /* 0x0 */ u32 *unk0;
    /* 0x4 */ u32 *unk4;
    /* 0x8 */ u32 *unk8;
    /* 0xC */ u32 *unkC;
    /* 0x10 */ u32 *unk10;
    /* 0x14 */ u32 *unk14;
    /* 0x18 */ u32 unk18;
    /* 0x1C */ u32 unk1C;
    /* 0x20 */ u32 unk20;
    /* 0x24 */ u8 *unk24;
    /* 0x28 */ u8 *unk28;
    /* 0x2C */ u32 unk2C;
    /* 0x30 */ struct unkTimeStruct *unk30;
    u32 unk34;
    u32 unk38;
    u32 unk3C;
    u32 unk40;
    u32 unk44;
    u32 unk48;
    u8 *unk04C;
    u32 unk050;
    u32 unk054;
    u32 unk058;
};

