#include "constants/item.h"
#include "global.h"
#include "constants/iq_skill.h"
#include "input.h"
#include "item.h"
#include "memory.h"
#include "pokemon.h"
#include "pokemon_3.h"
#include "team_inventory.h"
#include "text.h"
#include "subStruct_203B240.h"
#include "menu_input.h"

struct unkStruct_203B234
{
    // size: 0x154
    u32 unk0;
    u32 state;
    u32 fallbackState;
    u8 unkC;
    struct Item unk10;
    struct unkStruct_8090F58 unk14;
    struct Item unk20;
    u32 unk24;
    struct MenuStruct unk28;
    struct MenuStruct unk78;
    u32 menuAction;
    struct MenuItem unkCC[5];
    struct UnkTextStruct2 unkF4[4];
};

extern struct unkStruct_203B234 *gUnknown_203B234;


struct unkStruct_203B238
{
    // size: 0x124
    u32 state;
    s16 species;
    struct PokemonStruct *pokeStruct;
    u8 iqSkills[NUM_IQ_SKILLS];
    u32 unk24;
    u8 iqSkillIndex;
    u32 numIQSkills;
    s32 menuAction;
    struct MenuItem unk34[8];
    struct MenuStruct unk74;
    struct UnkTextStruct2 unkC4[4];
};

struct unkStruct_203B23C
{ 
    // size: 0xC4
    /* 0x0 */ s16 species;
    /* 0x4 */ struct PokemonStruct *pokeStruct;
    /* 0x8 */ u8 iqSkills[NUM_IQ_SKILLS];
    /* 0x20 */ s32 numIQSkills;
    /* 0x24 */ u32 unk24;
    u8 fill28[0x3C - 0x28];
    s16 unk3C;
    s16 unk3E;
    s16 unk40;
    s16 unk42;
    s16 unk44;
    s16 unk46;
    u8 fill48[0x52 - 0x48];
    u8 unk52;
    u8 fill52[0x58 - 0x53];
    u32 unk58;
    /* 0x5C */ struct UnkTextStruct2 *unk5C;
    /* 0x60 */ struct UnkTextStruct2 unk60[4];
    u8 unkC0;
    u8 unkC1;
    u8 unkC2;
    u8 unkC3;
};

struct unkStruct_203B240
{
    // size: 0x94
    s32 state;
    u8 chosenIQSkill;
    s32 unk8;
    s32 unkC;
    struct subStruct_203B240 *unk10[2];
    u8 fill14[0x20 - 0x18];
    u32 unk20;
    u32 unk24;
    struct UnkTextStruct2 unk28[4];
    u32 unk88;
    u32 unk8C;
    u32 unk90;
};

struct unkStruct_203B244
{
    // size: 0x554
    u32 unk0;
    u8 itemIDs[NUMBER_OF_ITEM_IDS];
    u32 unkF4[NUMBER_OF_ITEM_IDS];
    u32 unk4B4;
    u8 fill4B8[0x4CC - 0x4B8];
    s16 unk4CC;
    s16 unk4CE;
    s16 unk4D0;
    s16 unk4D2;
    s16 unk4D4;
    s16 itemCount;
    u8 fill4D8[0x4E8 - 0x4D8];
    u32 unk4E8;
    struct UnkTextStruct2 * unk4EC;
    struct UnkTextStruct2 unk4F0[4];
    u8 unk550[4];
};

struct unk_203B250
{
    struct PokemonStruct *unk0;
    s16 index;
    /* 0x6 */ u8 currFriendAreaLocation; // 0 when not in a friend area
    u8 unk7;
    u8 unk8;
    u8 unk9;
    struct PokemonStruct *unkC;
    u32 state;
    u32 menuAction;
    struct MenuStruct unk18;
    struct MenuItem unk68[8];
    u16 unkA8[8];
    struct UnkTextStruct2 unkB8[4];
};

extern struct unk_203B250 *gUnknown_203B250;
extern u32 gUnknown_203B254;

extern struct PokemonStruct *GetPlayerPokemonStruct(void);
extern u8 sub_8002658(s16);
extern s16 sub_80A5728(void);
extern void sub_801D208(u32);
extern void sub_801D680(void);
extern void sub_801D760(void);
extern void sub_801D77C(void);
extern void sub_801D798(void);
extern void sub_801D7CC(void);
extern void sub_801D808(void);
extern void sub_801D824(void);
extern void sub_801D840(void);
extern void sub_801D85C(void);
extern void sub_801D878(void);
s16 sub_80A7AE8(s32);
extern struct PokemonStruct *sub_808D3F8(void);

extern const struct UnkTextStruct2 gUnknown_80DBE54;
extern struct UnkTextStruct2 gUnknown_80DBDD8;
