#include "global.h"
#include "memory.h"
#include "pokemon.h"
#include "pokemon_3.h"
#include "text1.h"
#include "text2.h"

#include "menu_input.h"
#include "gulpin_shop.h"
#include "moves.h"
#include "felicity_bank.h"
#include "code_80130A8.h"
#include "code_801EE10_1.h"
#include "code_80118A4.h"

// size: 0x1E0
struct unkStruct_203B27C
{
    /* 0x0 */ bool32 isAsleep;
    /* 0x4 */ s32 state;
    /* 0x8 */ u32 fallbackState;
    /* 0xC */ s16 speciesNum;
    /* 0x10 */ PokemonStruct1 *pokeStruct;
    /* 0x14 */ bool8 isNextMoveLinked;
    bool8 unk15;
    /* 0x16 */ bool8 isTeamLeader;
    /* 0x18 */ u32 moveIndex;
    // Group of move ids but not sure purpose just yet...
    u16 unk1C;
    u16 unk1E;
    u16 unk20;
    /* 0x24 */ struct Move moves[MAX_MON_MOVES * 2];
    /* 0x64 */ u16 sequenceMoveIDs[MAX_MON_MOVES];
    /* 0x6C */ u32 menuAction1;
    /* 0x70 */ u32 menuAction2;
    /* 0x74 */ u32 menuAction3;
    /* 0x78 */ u32 menuAction4;
    MenuItem unk7C[8];
    u16 unkBC[8];
    MenuStruct unkCC;
    u8 fill11C[0x16C - 0x11C];
    /* 0x16C */ OpenedFile *faceFile;
    /* 0x170 */ u8 *faceData;
    u16 unk174;
    u16 unk176;
    u8 unk178;
    u8 unk179;
    u8 unk17A;
    OpenedFile **unk17C;
    UnkTextStruct2 unk180[4];
};

EWRAM_DATA_2 struct unkStruct_203B27C *gUnknown_203B27C = {0};

extern u8 gAvailablePokemonNames[];
extern u8 gUnknown_202DFE8[];
extern u8 gUnknown_202E1C8[];
extern u8 gUnknown_202E5D8[];

extern UnkTextStruct2 gUnknown_80DC31C;
extern UnkTextStruct2 gUnknown_80DC334;
extern UnkTextStruct2 gUnknown_80DC31C;
extern UnkTextStruct2 gUnknown_80DC34C;
extern UnkTextStruct2 gUnknown_80DC37C;

extern const u8 *gGulpinDialogue[2][25];
extern u8 gUnknown_80DC3D8[];
extern u8 gUnknown_80DC3E0[];
extern u8 gUnknown_80DC3E8[];
extern u8 gUnknown_80DC3F4[];
extern u8 gUnknown_80DC394[];
extern u8 gGulpinProceed[];
extern u8 gGulpinInfo[];
extern u8 *gUnknown_80D4934[];
extern u8 *gUnknown_80D4920[];
extern u8 *gUnknown_80D4928[];
extern u8 gGulpinForget[];
extern u8 gGulpinLink[];
extern u8 gGulpinDelink[];
extern u8 gGulpinSet[];
