#include "global.h"
#include "globaldata.h"
#include "structs/menu.h"
#include "structs/str_mon_portrait.h"
#include "structs/str_text.h"
#include "music_util.h"
#include "code_801B3C0.h"
#include "code_8099360.h"
#include "common_strings.h"
#include "felicity_bank.h"
#include "input.h"
#include "items.h"
#include "kecleon_bros1.h"
#include "kecleon_bros2.h"
#include "kecleon_bros3.h"
#include "kecleon_bros4.h"
#include "memory.h"
#include "menu_input.h"
#include "pokemon.h"
#include "string_format.h"
#include "text_1.h"

enum KecleonStoreStates
{
    KECLEON_STORE_INIT = 0,
    KECLEON_STORE_MAIN_MENU,
    KECLEON_STORE_INFO,
    KECLEON_STORE_UNK3,
    KECLEON_STORE_EXIT,
    KECLEON_STORE_NO_STORE_ITEMS,
    KECLEON_STORE_NO_MONEY,
    KECLEON_STORE_TOO_MUCH_MONEY,
    KECLEON_STORE_NO_ITEMS_TO_SELL,
    KECLEON_STORE_NO_ITEMS,
    KECLEON_STORE_TOO_MANY_ITEMS,
    KECLEON_STORE_UNK11,
    KECLEON_STORE_NOT_ENOUGH_MONEY,
    KECLEON_STORE_CANT_SELL_ITEM,
    KECLEON_STORE_SELL_ITEM_TOO_MUCH_MONEY,
    KECLEON_STORE_UNK15,
    KECLEON_STORE_BUY_ITEM_MENU,
    KECLEON_STORE_BUY_ITEM_RECEIPT,
    KECLEON_STORE_UNK18,
    KECLEON_STORE_UNK19,
    KECLEON_STORE_UNK20,
    KECLEON_STORE_BUY_ITEM_INFO,
    KECLEON_STORE_BUY_ITEM,
    KECLEON_STORE_UNK23,
    KECLEON_STORE_SELL_ITEM_MENU,
    KECLEON_STORE_SELL_ITEM_RECEIPT,
    KECLEON_STORE_UNK26,
    KECLEON_STORE_UNK27,
    KECLEON_STORE_UNK28,
    KECLEON_STORE_SELL_ITEM_INFO,
    KECLEON_STORE_SELL_ITEM,
    KECLEON_STORE_SELL_ALL_ITEMS,
    KECLEON_STORE_SELL_ALL_ITEMS_RECEIPT,
};

enum MenuActions
{
    CANCEL_ACTION = 1,
    BUY_ACTION,
    SELL_ACTION,
    SELL_ALL_ACTION,
    YES_ACTION,
    NO_ACTION,
    INFO_ACTION
};

// size: R=0x148 | B=0x144
typedef struct KecleonBrosWork1
{
    /* 0x0 */ u32 mode; // Corresponds to the enum: KecleonBrosMode
    /* 0x4 */ bool8 isKecleonItemShop; // FALSE indicates it is Kecleon TM Shop
    /* 0x8 */ u32 currState;
    /* 0xC */ u32 fallbackState;
    /* 0x10 */ s32 itemSellPrice;
    /* 0x14 */ u32 numInventoryItemToSell;
    /* 0x18 */ s32 inventoryItemSellPrice;
    /* 0x1C */ Item soldItem;
    /* 0x20 */ u8 itemShopItemIndex; // TODO: 0x1F
    /* 0x21 */ u8 wareShopItemIndex;
    /* 0x24 */ u32 soldItemInventoryIndex;
    /* 0x28 */ u32 menuAction1;
    /* 0x2C */ u32 menuAction2;
    /* 0x30 */ u32 menuAction3;
    /* 0x34 */ MenuItem menuItems[8];
    /* 0x74 */ u16 unk74[8];
    /* 0x84 */ MenuStruct menu;
    /* 0xD4 */ MonPortraitMsg monPortrait; // This seems to start 4 bytes earlier on NDS. I think MenuStruct is shorter
    /* 0xE4 */ MonPortraitMsg *monPortraitPtr;
    /* 0xE8 */ WindowTemplates unkE8;
} KecleonBrosWork1;

static EWRAM_INIT KecleonBrosWork1 *sKecleonBrosWork1 = {NULL}; // NDS=020EAD7C

#include "data/kecleon_bros1.h"

static u32 CountKecleonItems(void);
static void SetKecleonBrosState(u32);
static void UpdateKecleonStoreDialogue(void);

static void sub_8018D30(void);
static void BuildKecleonBrosMainMenu(void);
static void BuildKecleonBrosBuyItemMenu(void);
static void BuildKecleonBrosSellItemMenu(void);
static void BuildKecleonBrosYesNoMenu(void);
static void HandleKecleonBrosMainMenu(void);
static void HandleKecleonBrosBuyItemYesNoMenu(void);
static void HandleKecleonBrosSellItemYesNoMenu(void);
static void HandleKecleonBrosSellAllItemsMenu(void);
static void sub_80199CC(void);
static void sub_8019B08(void);
static void HandleKecleonBrosBuyItemMenu(void);
static void HandleKecleonBrosSellItemMenu(void);
static void sub_8019D30(void);
static void sub_8019D4C(void);
static void ProceedToKecleonBros1FallbackState(void);
